{
  "Home": "হোম",
  "About us": "আমাদের সম্পর্কে",
  "Olympiad": "অলিম্পিয়াড",
  "Learn": "শিখুন",
  "Blog": "ব্লগ",
  "Login": "লগইন",
  "Profile": "প্রোফাইল",
  "Create Scratch": "স্ক্র্যাচ তৈরি করুন",
  "Read more": "আরো পড়ুন",
  "Scratch Bangladesh": "স্ক্র্যাচ বাংলাদেশ",
  "We Are working to make programming popular country wide. You will find Scratch Programming Tutorials, Project Idea's, Courses and Many more news about Events on Scratch Programming in Scratch bangladesh Website.": "আমরা দেশব্যাপী বাংলা ভাষায় প্রোগ্রামিংকে জনপ্রিয় করতে কাজ করে যাচ্ছি। বাংলা ভাষায় স্ক্র্যাচ এর উপর টিউটোরিয়াল, প্রজেক্ট আইডিয়া, কোর্স সহ বছরব্যাপী নানা আয়োজনের খবর স্ক্র্যাচ বাংলাদেশ ওয়েবসাইটে পাওয়া যাবে।",
  "A user profile is a collection of settings and information associated with a user. It contains critical information that is used to identify an individual, such as their name, age, portrait photograph and individual characteristics such as knowledge or expertise. A user profile is a collection of settings and information associated with a user. It contains critical information that is used to identify an individual, such as their name, age, portrait photograph and individual characteristics such as knowledge or expertise.": "একটি ব্যবহারকারীর প্রোফাইল হল একটি ব্যবহারকারীর সাথে সম্পর্কিত সেটিংস এবং তথ্যের একটি সংগ্রহ৷ এটিতে গুরুত্বপূর্ণ তথ্য রয়েছে যা একজন ব্যক্তিকে সনাক্ত করতে ব্যবহৃত হয়, যেমন তাদের নাম, বয়স, প্রতিকৃতি ফটোগ্রাফ এবং জ্ঞান বা দক্ষতার মতো স্বতন্ত্র বৈশিষ্ট্য। একটি ব্যবহারকারীর প্রোফাইল হল একটি ব্যবহারকারীর সাথে সম্পর্কিত সেটিংস এবং তথ্যের একটি সংগ্রহ৷ এটিতে গুরুত্বপূর্ণ তথ্য রয়েছে যা একজন ব্যক্তিকে সনাক্ত করতে ব্যবহৃত হয়, যেমন তাদের নাম, বয়স, প্রতিকৃতি ফটোগ্রাফ এবং জ্ঞান বা দক্ষতার মতো স্বতন্ত্র বৈশিষ্ট্য।",
  "Learn Scratch in Bangla": "স্ক্র্যাচ শিখুন বাংলায়",
  "Scratch is a block-based programming language through which People of any age, from elementary school students Can easily learn programming logic and besides games, animation videos, art Various projects can be created. Scratch is used in more than 70 languages and more than 200 countries around the world. Since 2021, Scratch is also being used in Bengali language. Currently there is an offline desktop version of Scratch available in Bengali along with the main website and Scratch editor.": "স্ক্র্যাচ (Scratch) হল একটি ব্লকভিত্তিক প্রোগ্রামিং ভাষা যার মাধ্যমে প্রাথমিক বিদ্যালয়ের শীক্ষার্থী থেকে শুরু করে যে কোন বয়সের মানুষ খুব সহজেই প্রোগ্রামিং লজিক শিখতে পারে এবং গেইম, এনিমেশন ভিডিও, আর্ট ছাড়াও নানা রকম প্রজেক্ট তৈরি করাতে পারে। বিশ্বের প্রায় ৭০ টির অধিক ভাষায় ও ২০০ টির অধিক দেশ থেকে স্ক্র্যাচ ব্যবহার করা হয়ে থাকে। ২০২১ সাল থেকে বাংলা ভাষায় ও স্ক্র্যাচ  ব্যবহার করা যাচ্ছে। বর্তমানে মূল ওয়েবসাইট এবং স্ক্র্যাচ এডিটরের পাশাপাশি স্ক্র্যাচের অফলাইন ডেক্সটপ সংস্করণও বাংলায় ব্যবহার করার সুযোগ রয়েছে।",

 "Featured Project" : "ফিচার্ড প্রজেক্ট",
 "Created By" : "তৈরি করেছে",
 "Scratch Profile" : "স্ক্র্যাচ প্রোফাইল",
 "Courses" : "পাঠ্যধারাগুলি",
 "Scratch tips and tricks" : "স্ক্র্যাচ টিপস এবং কৌশল",
 "Categories" : "ক্যাটাগরি",
 "Scratch Premium" : "স্ক্র্যাচ প্রিমিয়াম"
}