{
  "Home": "হোম",
  "About us": "আমাদের সম্পর্কে",
  "Olympiad": "অলিম্পিয়াড",
  "Learn": "শিখুন",
  "Blog": "ব্লগ",
  "Login": "লগইন",
  "Profile": "প্রোফাইল",
  "Create Scratch": "স্ক্র্যাচ তৈরি করুন",
  "Read more": "আরো পড়ুন",
  "Scratch Bangladesh": "স্ক্র্যাচ বাংলাদেশ",
  "We Are working to make programming popular country wide. You will find Scratch Programming Tutorials, Project Idea's, Courses and Many more news about Events on Scratch Programming in Scratch bangladesh Website.": "আমরা দেশব্যাপী বাংলা ভাষায় প্রোগ্রামিংকে জনপ্রিয় করতে কাজ করে যাচ্ছি। বাংলা ভাষায় স্ক্র্যাচ এর উপর টিউটোরিয়াল, প্রজেক্ট আইডিয়া, কোর্স সহ বছরব্যাপী নানা আয়োজনের খবর স্ক্র্যাচ বাংলাদেশ ওয়েবসাইটে পাওয়া যাবে।",
  "A user profile is a collection of settings and information associated with a user. It contains critical information that is used to identify an individual, such as their name, age, portrait photograph and individual characteristics such as knowledge or expertise. A user profile is a collection of settings and information associated with a user. It contains critical information that is used to identify an individual, such as their name, age, portrait photograph and individual characteristics such as knowledge or expertise.": "একটি ব্যবহারকারীর প্রোফাইল হল একটি ব্যবহারকারীর সাথে সম্পর্কিত সেটিংস এবং তথ্যের একটি সংগ্রহ৷ এটিতে গুরুত্বপূর্ণ তথ্য রয়েছে যা একজন ব্যক্তিকে সনাক্ত করতে ব্যবহৃত হয়, যেমন তাদের নাম, বয়স, প্রতিকৃতি ফটোগ্রাফ এবং জ্ঞান বা দক্ষতার মতো স্বতন্ত্র বৈশিষ্ট্য। একটি ব্যবহারকারীর প্রোফাইল হল একটি ব্যবহারকারীর সাথে সম্পর্কিত সেটিংস এবং তথ্যের একটি সংগ্রহ৷ এটিতে গুরুত্বপূর্ণ তথ্য রয়েছে যা একজন ব্যক্তিকে সনাক্ত করতে ব্যবহৃত হয়, যেমন তাদের নাম, বয়স, প্রতিকৃতি ফটোগ্রাফ এবং জ্ঞান বা দক্ষতার মতো স্বতন্ত্র বৈশিষ্ট্য।",
  "Learn Scratch in Bangla": "স্ক্র্যাচ শিখুন বাংলায়",
  "Scratch is a block-based programming language through which People of any age, from elementary school students Can easily learn programming logic and besides games, animation videos, art Various projects can be created. Scratch is used in more than 70 languages and more than 200 countries around the world. Since 2021, Scratch is also being used in Bengali language. Currently there is an offline desktop version of Scratch available in Bengali along with the main website and Scratch editor.": "স্ক্র্যাচ (Scratch) হল একটি ব্লকভিত্তিক প্রোগ্রামিং ভাষা যার মাধ্যমে প্রাথমিক বিদ্যালয়ের শীক্ষার্থী থেকে শুরু করে যে কোন বয়সের মানুষ খুব সহজেই প্রোগ্রামিং লজিক শিখতে পারে এবং গেইম, এনিমেশন ভিডিও, আর্ট ছাড়াও নানা রকম প্রজেক্ট তৈরি করাতে পারে। বিশ্বের প্রায় ৭০ টির অধিক ভাষায় ও ২০০ টির অধিক দেশ থেকে স্ক্র্যাচ ব্যবহার করা হয়ে থাকে। ২০২১ সাল থেকে বাংলা ভাষায় ও স্ক্র্যাচ  ব্যবহার করা যাচ্ছে। বর্তমানে মূল ওয়েবসাইট এবং স্ক্র্যাচ এডিটরের পাশাপাশি স্ক্র্যাচের অফলাইন ডেক্সটপ সংস্করণও বাংলায় ব্যবহার করার সুযোগ রয়েছে।",
  "Featured Project": "ফিচার্ড প্রজেক্ট",
  "Created By": "তৈরি করেছে",
  "Scratch Profile": "স্ক্র্যাচ প্রোফাইল",
  "Courses": "পাঠ্যধারাগুলি",
  "Scratch tips and tricks": "স্ক্র্যাচ টিপস এবং কৌশল",
  "Categories": "ক্যাটাগরি",
  "Scratch Premium": "স্ক্র্যাচ প্রিমিয়াম",
  "Start Now": "শুরু কর",
  "video tutorial": "ভিডিও টিউটোরিয়াল",
  "Paid": "পরিশোধ করা",
  "Scratch Basic": "স্ক্র্যাচ বেসিক",
  "Scratch programming for everyone": "সবার জন্য স্ক্র্যাচ প্রোগ্রামিং",
  "Learning programming is popular among elementary school students Scratch Bangladesh is bringing a new way to do this. scratch A block-base programming language, along with Scratch for kids and teens Useful The world's largest programming community. using scratch Programming logic is very easy to learn and digital stories, animation videos,Games etc. projects can be created. Games, animations, presentations,Graphics art work, interactive stories etc. are of different types Everything needed to create a project is easily possible in Scratch. here Rather than writing code by typing on the keyboard like in other programming languages Using only blocks to perform tasks, learning from scratch is easier. Scratch.mit.edu website in more than 80 languages Programming can be done, but now in Bengali language as Bengali is added Coding is possible. Scratch Bangladesh on scratch in Bengali language Tutorials, Project Ideas, Courses etc. Various events throughout the year organizes Scratch Bangladesh is our country's primary school A new milestone for students, who are new to learning programming will open the door": "প্রাথমিক বিদ্যালয়ের শিক্ষার্থীদের মধ্যে প্রোগ্রামিং শেখা জনপ্রিয় করার লক্ষ্যে একটি নতুন পথ স্ক্র্যাচ বাংলাদেশ নিয়ে আসছে। স্ক্র্যাচ একটি ব্লক ভিত্তিক প্রোগ্রামিং ভাষা, একই সাথে স্ক্র্যাচ শিশু-কিশোরদের উপযোগী বিশ্বের সবথেকে বড় প্রোগ্রামিং কমিউনিটি। স্ক্র্যাচ ব্যবহার করে প্রোগ্রামিং লজিক শেখা খুব সহজ হয় এবং ডিজিটাল গল্প, এনিমেশন ভিডিও, গেম ইত্যাদি প্রজেক্ট তৈরি করা যায়। গেম, এনিমেশন, প্রেজেন্টেশন, গ্রাফিক্স আর্ট ওয়ার্ক, মিথস্ক্রিয় গল্প ইত্যাদি বিভিন্ন ধরনের প্রজেক্ট তৈরি করতে যা প্রয়োজন সবকিছু স্ক্র্যাচে সহজেই সম্ভব। এখানে অন্যান্য প্রোগ্রামিং ভাষার মত কীবোর্ডে টাইপ করে কোড লিখতে হয় না, বরং শুধুমাত্র ব্লক ব্যবহার করে কাজ সম্পাদন করা যায়, এতে স্ক্র্যাচ শেখা সহজ হয়। বিশ্বের মোট ৮০ টির অধিক ভাষায় Scratch.mit.edu ওয়েবসাইটে প্রোগ্রামিং করা যায়, তবে বর্তমানে বাংলাকে যোগ করায় এখন বাংলা ভাষায় কোডিং করা সম্ভব। স্ক্র্যাচ বাংলাদেশ বাংলা ভাষায় স্ক্র্যাচের উপর টিউটোরিয়াল, প্রজেক্ট আইডিয়া, কোর্স ইত্যাদি বছরব্যাপী নানা অনুষ্ঠান আয়োজন করে থাকে। স্ক্র্যাচ বাংলাদেশ আমাদের দেশের প্রাথমিক বিদ্যালয়ের শিক্ষার্থীদের জন্য একটি নতুন মাইলফলক, যা প্রোগ্রামিং শেখার নতুন দ্বার উন্মোচন করবে",
  "By learning Scratch, students can create games, animation videos and cartoons. Scratch programming does not require learning any coding. Scratch programming is available in more than 80 languages ​​in the world. Now Bengali language is also included in that list. As a result, coding can also be done in Bengali language with Scratch. This is a new milestone for Bengali language. Students need to know computer programming to be proficient in future technology fields.To this end the Government of Bangladesh has included programming education in the school curriculum. Scratch Olympiad is being organized in Bangladesh from 2023 to encourage students to learn programming through Scratch.  Students from 1st to 8th class can participate in total 3 categories in the competition.": "স্ক্র্যাচ শেখার মাধ্যমে শিক্ষার্থীরা গেম, অ্যানিমেশন ভিডিও এবং কার্টুন তৈরি করতে পারে। স্ক্র্যাচ প্রোগ্রামিং করতে কোন কোডিং শিখতে হয় না। বিশ্বের মোট ৮০টির অধিক ভাষায় স্ক্র্যাচ প্রোগ্রামিং করার যায়। এখন বাংলা ভাষাও সেই তালিকায় যুক্ত আছে। ফলে স্ক্র্যাচ দিয়ে বাংলা ভাষায়ও কোডিং করা যায়। এটি বাংলা ভাষার জন্য এক নতুন মাইলফলক। ভবিষ্যতে প্রযুক্তি ক্ষেত্রে দক্ষতার জন্য শিক্ষার্থীদের কম্পিউটার প্রোগ্রামিং জানা আবশ্যক। এই লক্ষ্যে বাংলাদেশ সরকার স্কুলের পাঠ্যসূচিতে প্রোগ্রামিং শিক্ষাকে অন্তর্ভূক্ত করেছে। শিক্ষার্থীদেরকে স্ক্র্যাচ এর মাধ্যমে প্রোগ্রামিং শিক্ষায় আরও উৎসাহী করার লক্ষে ২০২৩ সাল থেকে বাংলাদেশে স্ক্র্যাচ অলিম্পিয়াড আয়োজন করা হচ্ছে। প্রতিযোগিতায় ১ম থেকে ৮ম শ্রেণী পর্যন্ত শিক্ষার্থীরা মোট ৩ টি ক্যাটাগরিতে অংশ নিতে পারে।",
  "Catagories Are:": "ক্যাটাগরি গুলি হল:",
  "Bangladesh Scratch Olympiad": "বাংলাদেশ স্ক্র্যাচ অলিম্পিয়াড",
  "Students in each category are specific on a particular story Create a game or animation project using some characters (Sprites) have to do In that case the story and the total are in question during the Olympiad The number of characters (Sprite) is mentioned.": "প্রতিটি ক্যাটাগরির শিক্ষার্থীদের একটি নির্দিষ্ট গল্পের উপর নির্দিষ্টকিছু চরিত্র (Sprite) ব্যবহার করে একটি গেইম অথবা এনিমেশন প্রজেক্ট তৈরি করতে হয়। সেক্ষেত্রে অলিম্পিয়াডের সময় প্রশ্নের মধ্যে গল্প ও মোট চরিত্রের (Sprite) সংখ্যা উল্লেখ করা থাকে।",
  "Category 1": "ক্যাটাগরি ১", "Class 1 to CLass 4" : "১ম থেকে ৪র্থ শ্রেণী",
  "Category 2": "ক্যাটাগরি ২", "Class 5 and CLass 6" : "৫ম ও ৬ষ্ঠ শ্রেণী",
  "Category 3": "ক্যাটাগরি ৩", "Class 7 and Class 8" : "৭ম ও ৮ম শ্রেণী",
  "Previous Year Questions:" : "বিগত বছরের প্রশ্ন:",
  "Olympiad Photo Gallery:" : "অলিম্পিয়াড ফটো গ্যালারি:",
  "Address" : "ঠিকানা",
  "Contact Us" : "যোগাযোগ করুন",
  "Dhaka 1209" : "ঢাকা 1209",
  "Quick Links" : "কুইক লিংক"

}